tap 'aws/tap'
tap 'hashicorp/tap'

# ============================================================================
# DevOps
# ============================================================================
# AWS Cli console.
brew 'awscli'
# Script for perform authentications inside amazon
brew 'aws-iam-authenticator'
# EC2 instance selector helper CLI tool
brew 'ec2-instance-selector'

cask 'docker'
# Terminal GUI to manage and watch Kubernetes resources
brew 'k9s'
# Kubectl plugin manager
brew 'krew'
# Local kubernetes cluster
brew 'minikube'
# Required for local port forwarding in a public IP
cask 'ngrok'
# To manage multiples versions of terraform
brew 'tfenv'
# To get vulnerabilities
brew 'tfsec'
# To lint Terraform files
brew 'tflint'
# To get generate documentation
brew 'terraform-docs'
# To get the infrastructure cost
brew 'infracost'

# To manage virtual machines
cask 'vagrant'
# cask 'virtualbox'
# To build infrastructure images
brew 'hashicorp/tap/packer'

# Required for Ansible to ssh machines without prompt ssh
tap 'hudochenkov/sshpass'
brew 'sshpass'

# To have yq
brew 'yq'

# To execute the Terraform Resource Generator tool
cask 'google-chrome'
cask 'chromedriver'
